; domain
;PEOPLE might need food crates, meds crates, or both
;ROBOT can move between locations, can go back to base (depot) directly; 
;can load crates
;CRATES in depot are supposed to contain either food or meds; can be picked
;up and delivered by the ROBOT.

(define (domain basicDelivery)

;remove requirements that are not needed
(:requirements :typing :equality :negative-preconditions :disjunctive-preconditions)

(:types 
    robot - object
    crate - object
    person - object
    location - object
    food meds - crate
)

; un-comment following line if constants are needed
(:constants
    operator - robot
)

(:predicates
    ;crates
    (crate_at ?c - crate ?l - location)     ;crate ?c crate_at at location ?l
    (is_available ?c - crate)          ;crate can be loaded
    
    ;robot
    (robot_at ?r - robot ?l - location)     ;robot ?r is at location ?l
    (is_empty ?r - robot)           ;robot ?r is empty
    (bearing ?r - robot ?c - crate)         ;robot ?r is bearing crate ?c
    
    ;people
    (person_at ?p - person ?l - location)       ;person ?p is at location ?l
    (served ?p - person ?c - crate)              ;person ?p has been served with crate ?c
    )

;moves robot between two locations: ?from and ?to
(:action move
    :parameters (?r - robot ?from ?to - location)
    :precondition (and 
        (robot_at ?r ?from)(not (= ?from ?to))
        )
    :effect (and 
        (robot_at ?r ?to)(not (robot_at ?r ?from))
        )
)


;load (generic) crate ?c onto robot ?r at location ?l
(:action load_crate
    :parameters (?l - location ?c - crate ?r - robot)
    :precondition (and 
        (robot_at ?r ?l)(is_empty ?r)
        (crate_at ?c ?l)(is_available ?c)
        (not (bearing ?r ?c))
        )
    :effect (and 
        (bearing ?r ?c)(not (is_empty ?r))
        (not (crate_at ?c ?l))
    )
)


;;deliver (generic) crate ?c to location ?l to person ?p
(:action deliver_crate
    :parameters (?r - robot ?c - crate ?l - location ?p - person)
    :precondition (and 
        (robot_at ?r ?l)(person_at ?p ?l)
        (bearing ?r ?c)
        )
    :effect (and 
        (is_empty ?r)(served ?p ?c)(crate_at ?c ?l)
        (not (bearing ?r ?c))(not (is_available ?c))
    )
)

)

; problem
(define (problem problem1) (:domain basicDelivery)
(:objects
    depot l1 l2 l3 - location
    matteo alice francesco eliana - person
    m1 m2 m3 - meds
    f1 f2 f3 - food

)

(:init
    ;crates location
    (crate_at m1 depot)
    (crate_at m2 depot)
    (crate_at m3 depot)
    (crate_at f1 depot)
    (crate_at f2 depot)
    (crate_at f3 depot)
    ;crate availability
    (is_available m1)
    (is_available m2)
    (is_available m3)
    (is_available f1)
    (is_available f2)
    (is_available f3)

    ;robot location
    (robot_at operator depot)
    (is_empty operator)

    ;people location
    (person_at matteo l1)
    (person_at eliana l2)
    (person_at francesco l2)

)

(:goal (and
    
    ;Eliana needs food
    (or
        (served eliana f1)(served eliana f2)(served eliana f3)
    )
    
    ;Matteo needs both food and meds
    (or
        (served matteo f1)(served matteo f2)(served matteo f3)
    )
    (or
        (served matteo m1)(served matteo m2)(served matteo m3)
    )

    ;Francesco needs meds
    (or
        (served francesco m1)(served francesco m2)(served francesco m3)
    )
))

)

; plan
1. (load_crate depot f1 operator)
   deleted: (is_empty operator) (crate_at f1 depot)
   added: (bearing operator f1)
   goals met: 0 of 4
2. (move operator depot l1)
   deleted: (robot_at operator depot)
   added: (robot_at operator l1)
   goals met: 0 of 4
3. (deliver_crate operator f1 l1 matteo)
   deleted: (bearing operator f1) (is_available f1)
   added: (is_empty operator) (served matteo f1) (crate_at f1 l1)
   goals met: 1 of 4
4. (move operator l1 depot)
   deleted: (robot_at operator l1)
   added: (robot_at operator depot)
   goals met: 1 of 4
5. (load_crate depot f2 operator)
   deleted: (is_empty operator) (crate_at f2 depot)
   added: (bearing operator f2)
   goals met: 1 of 4
6. (move operator depot l2)
   deleted: (robot_at operator depot)
   added: (robot_at operator l2)
   goals met: 1 of 4
7. (deliver_crate operator f2 l2 eliana)
   deleted: (bearing operator f2) (is_available f2)
   added: (is_empty operator) (served eliana f2) (crate_at f2 l2)
   goals met: 2 of 4
8. (move operator l2 depot)
   deleted: (robot_at operator l2)
   added: (robot_at operator depot)
   goals met: 2 of 4
9. (load_crate depot m1 operator)
   deleted: (is_empty operator) (crate_at m1 depot)
   added: (bearing operator m1)
   goals met: 2 of 4
10. (move operator depot l1)
   deleted: (robot_at operator depot)
   added: (robot_at operator l1)
   goals met: 2 of 4
11. (deliver_crate operator m1 l1 matteo)
   deleted: (bearing operator m1) (is_available m1)
   added: (is_empty operator) (served matteo m1) (crate_at m1 l1)
   goals met: 3 of 4
12. (move operator l1 depot)
   deleted: (robot_at operator l1)
   added: (robot_at operator depot)
   goals met: 3 of 4
13. (load_crate depot m2 operator)
   deleted: (is_empty operator) (crate_at m2 depot)
   added: (bearing operator m2)
   goals met: 3 of 4
14. (move operator depot l2)
   deleted: (robot_at operator depot)
   added: (robot_at operator l2)
   goals met: 3 of 4
15. (deliver_crate operator m2 l2 francesco)
   deleted: (bearing operator m2) (is_available m2)
   added: (is_empty operator) (served francesco m2) (crate_at m2 l2)
   goals met: 4 of 4
